dunknowcoding/NiusBurner/niusburner/arduino/pic16/boards.txt
# NiusBurner pic16 boards.
#
# Copyright 2026 dunknowcoding (NiusRobotLab)
# SPDX-License-Identifier: Apache-2.0
#
# Generated from niusburner/boards.json by `python -m niusburner setup`.
# Edit the catalog, not this file.
#
# Defaults are the safe answer, not the fastest one: Size, because
# these parts run out of room long before cycles;
# because symbols cost build time and disk rather than flash; and
# auto-detection, because a compiler is normally where its own
# installer put it.

menu.optimize=Optimize
menu.compiler=Compiler

# ----------------------------------------------------------------------
# 1 K words, 18-pin, USART, comparators.
pic16f627a.name=16F627A (1 K words, PICkit 3)
pic16f627a.upload.tool=niusburner
pic16f627a.upload.protocol=pickit3
pic16f627a.upload.maximum_size=1024
pic16f627a.upload.maximum_data_size=224
pic16f627a.upload.require_upload_port=false
pic16f627a.build.mcu=16F627A
pic16f627a.build.f_cpu=20000000L
pic16f627a.build.board=16F627A
pic16f627a.build.core=niusburner
pic16f627a.build.variant=standard
pic16f627a.build.nb_board=pic16f627a
pic16f627a.build.extra_flags=

pic16f627a.menu.optimize.size=Size (default)
pic16f627a.menu.optimize.size.build.nb_optimize=size
pic16f627a.menu.optimize.speed=Speed
pic16f627a.menu.optimize.speed.build.nb_optimize=speed
pic16f627a.menu.optimize.none=None
pic16f627a.menu.optimize.none.build.nb_optimize=none

pic16f627a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f627a.menu.compiler.auto.build.nb_compiler=auto
pic16f627a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f627a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 2 K words, 18-pin, USART, comparators.
pic16f628a.name=16F628A (2 K words, PICkit 3)
pic16f628a.upload.tool=niusburner
pic16f628a.upload.protocol=pickit3
pic16f628a.upload.maximum_size=2048
pic16f628a.upload.maximum_data_size=224
pic16f628a.upload.require_upload_port=false
pic16f628a.build.mcu=16F628A
pic16f628a.build.f_cpu=20000000L
pic16f628a.build.board=16F628A
pic16f628a.build.core=niusburner
pic16f628a.build.variant=standard
pic16f628a.build.nb_board=pic16f628a
pic16f628a.build.extra_flags=

pic16f628a.menu.optimize.size=Size (default)
pic16f628a.menu.optimize.size.build.nb_optimize=size
pic16f628a.menu.optimize.speed=Speed
pic16f628a.menu.optimize.speed.build.nb_optimize=speed
pic16f628a.menu.optimize.none=None
pic16f628a.menu.optimize.none.build.nb_optimize=none

pic16f628a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f628a.menu.compiler.auto.build.nb_compiler=auto
pic16f628a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f628a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words, 18-pin, USART, comparators.
pic16f648a.name=16F648A (4 K words, PICkit 3)
pic16f648a.upload.tool=niusburner
pic16f648a.upload.protocol=pickit3
pic16f648a.upload.maximum_size=4096
pic16f648a.upload.maximum_data_size=256
pic16f648a.upload.require_upload_port=false
pic16f648a.build.mcu=16F648A
pic16f648a.build.f_cpu=20000000L
pic16f648a.build.board=16F648A
pic16f648a.build.core=niusburner
pic16f648a.build.variant=standard
pic16f648a.build.nb_board=pic16f648a
pic16f648a.build.extra_flags=

pic16f648a.menu.optimize.size=Size (default)
pic16f648a.menu.optimize.size.build.nb_optimize=size
pic16f648a.menu.optimize.speed=Speed
pic16f648a.menu.optimize.speed.build.nb_optimize=speed
pic16f648a.menu.optimize.none=None
pic16f648a.menu.optimize.none.build.nb_optimize=none

pic16f648a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f648a.menu.compiler.auto.build.nb_compiler=auto
pic16f648a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f648a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 1 K words, 18-pin, no USART and no analog.
pic16f84a.name=16F84A (1 K words, PICkit 3)
pic16f84a.upload.tool=niusburner
pic16f84a.upload.protocol=pickit3
pic16f84a.upload.maximum_size=1024
pic16f84a.upload.maximum_data_size=68
pic16f84a.upload.require_upload_port=false
pic16f84a.build.mcu=16F84A
pic16f84a.build.f_cpu=20000000L
pic16f84a.build.board=16F84A
pic16f84a.build.core=niusburner
pic16f84a.build.variant=standard
pic16f84a.build.nb_board=pic16f84a
pic16f84a.build.extra_flags=

pic16f84a.menu.optimize.size=Size (default)
pic16f84a.menu.optimize.size.build.nb_optimize=size
pic16f84a.menu.optimize.speed=Speed
pic16f84a.menu.optimize.speed.build.nb_optimize=speed
pic16f84a.menu.optimize.none=None
pic16f84a.menu.optimize.none.build.nb_optimize=none

pic16f84a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f84a.menu.compiler.auto.build.nb_compiler=auto
pic16f84a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f84a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f873.name=16F873 (4 K words, PICkit 3)
pic16f873.upload.tool=niusburner
pic16f873.upload.protocol=pickit3
pic16f873.upload.maximum_size=4096
pic16f873.upload.maximum_data_size=192
pic16f873.upload.require_upload_port=false
pic16f873.build.mcu=16F873
pic16f873.build.f_cpu=20000000L
pic16f873.build.board=16F873
pic16f873.build.core=niusburner
pic16f873.build.variant=standard
pic16f873.build.nb_board=pic16f873
pic16f873.build.extra_flags=

pic16f873.menu.optimize.size=Size (default)
pic16f873.menu.optimize.size.build.nb_optimize=size
pic16f873.menu.optimize.speed=Speed
pic16f873.menu.optimize.speed.build.nb_optimize=speed
pic16f873.menu.optimize.none=None
pic16f873.menu.optimize.none.build.nb_optimize=none

pic16f873.menu.compiler.auto=Auto-detect SDCC (default)
pic16f873.menu.compiler.auto.build.nb_compiler=auto
pic16f873.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f873.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f873a.name=16F873A (4 K words, PICkit 3)
pic16f873a.upload.tool=niusburner
pic16f873a.upload.protocol=pickit3
pic16f873a.upload.maximum_size=4096
pic16f873a.upload.maximum_data_size=192
pic16f873a.upload.require_upload_port=false
pic16f873a.build.mcu=16F873A
pic16f873a.build.f_cpu=20000000L
pic16f873a.build.board=16F873A
pic16f873a.build.core=niusburner
pic16f873a.build.variant=standard
pic16f873a.build.nb_board=pic16f873a
pic16f873a.build.extra_flags=

pic16f873a.menu.optimize.size=Size (default)
pic16f873a.menu.optimize.size.build.nb_optimize=size
pic16f873a.menu.optimize.speed=Speed
pic16f873a.menu.optimize.speed.build.nb_optimize=speed
pic16f873a.menu.optimize.none=None
pic16f873a.menu.optimize.none.build.nb_optimize=none

pic16f873a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f873a.menu.compiler.auto.build.nb_compiler=auto
pic16f873a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f873a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 40-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A.
pic16f874.name=16F874 (4 K words, PICkit 3)
pic16f874.upload.tool=niusburner
pic16f874.upload.protocol=pickit3
pic16f874.upload.maximum_size=4096
pic16f874.upload.maximum_data_size=192
pic16f874.upload.require_upload_port=false
pic16f874.build.mcu=16F874
pic16f874.build.f_cpu=20000000L
pic16f874.build.board=16F874
pic16f874.build.core=niusburner
pic16f874.build.variant=standard
pic16f874.build.nb_board=pic16f874
pic16f874.build.extra_flags=

pic16f874.menu.optimize.size=Size (default)
pic16f874.menu.optimize.size.build.nb_optimize=size
pic16f874.menu.optimize.speed=Speed
pic16f874.menu.optimize.speed.build.nb_optimize=speed
pic16f874.menu.optimize.none=None
pic16f874.menu.optimize.none.build.nb_optimize=none

pic16f874.menu.compiler.auto=Auto-detect SDCC (default)
pic16f874.menu.compiler.auto.build.nb_compiler=auto
pic16f874.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f874.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 40-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A.
pic16f874a.name=16F874A (4 K words, PICkit 3)
pic16f874a.upload.tool=niusburner
pic16f874a.upload.protocol=pickit3
pic16f874a.upload.maximum_size=4096
pic16f874a.upload.maximum_data_size=192
pic16f874a.upload.require_upload_port=false
pic16f874a.build.mcu=16F874A
pic16f874a.build.f_cpu=20000000L
pic16f874a.build.board=16F874A
pic16f874a.build.core=niusburner
pic16f874a.build.variant=standard
pic16f874a.build.nb_board=pic16f874a
pic16f874a.build.extra_flags=

pic16f874a.menu.optimize.size=Size (default)
pic16f874a.menu.optimize.size.build.nb_optimize=size
pic16f874a.menu.optimize.speed=Speed
pic16f874a.menu.optimize.speed.build.nb_optimize=speed
pic16f874a.menu.optimize.none=None
pic16f874a.menu.optimize.none.build.nb_optimize=none

pic16f874a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f874a.menu.compiler.auto.build.nb_compiler=auto
pic16f874a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f874a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f876.name=16F876 (8 K words, PICkit 3)
pic16f876.upload.tool=niusburner
pic16f876.upload.protocol=pickit3
pic16f876.upload.maximum_size=8192
pic16f876.upload.maximum_data_size=368
pic16f876.upload.require_upload_port=false
pic16f876.build.mcu=16F876
pic16f876.build.f_cpu=20000000L
pic16f876.build.board=16F876
pic16f876.build.core=niusburner
pic16f876.build.variant=standard
pic16f876.build.nb_board=pic16f876
pic16f876.build.extra_flags=

pic16f876.menu.optimize.size=Size (default)
pic16f876.menu.optimize.size.build.nb_optimize=size
pic16f876.menu.optimize.speed=Speed
pic16f876.menu.optimize.speed.build.nb_optimize=speed
pic16f876.menu.optimize.none=None
pic16f876.menu.optimize.none.build.nb_optimize=none

pic16f876.menu.compiler.auto=Auto-detect SDCC (default)
pic16f876.menu.compiler.auto.build.nb_compiler=auto
pic16f876.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f876.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f876a.name=16F876A (8 K words, PICkit 3)
pic16f876a.upload.tool=niusburner
pic16f876a.upload.protocol=pickit3
pic16f876a.upload.maximum_size=8192
pic16f876a.upload.maximum_data_size=368
pic16f876a.upload.require_upload_port=false
pic16f876a.build.mcu=16F876A
pic16f876a.build.f_cpu=20000000L
pic16f876a.build.board=16F876A
pic16f876a.build.core=niusburner
pic16f876a.build.variant=standard
pic16f876a.build.nb_board=pic16f876a
pic16f876a.build.extra_flags=

pic16f876a.menu.optimize.size=Size (default)
pic16f876a.menu.optimize.size.build.nb_optimize=size
pic16f876a.menu.optimize.speed=Speed
pic16f876a.menu.optimize.speed.build.nb_optimize=speed
pic16f876a.menu.optimize.none=None
pic16f876a.menu.optimize.none.build.nb_optimize=none

pic16f876a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f876a.menu.compiler.auto.build.nb_compiler=auto
pic16f876a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f876a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 40-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A.
pic16f877.name=16F877 (8 K words, PICkit 3)
pic16f877.upload.tool=niusburner
pic16f877.upload.protocol=pickit3
pic16f877.upload.maximum_size=8192
pic16f877.upload.maximum_data_size=368
pic16f877.upload.require_upload_port=false
pic16f877.build.mcu=16F877
pic16f877.build.f_cpu=20000000L
pic16f877.build.board=16F877
pic16f877.build.core=niusburner
pic16f877.build.variant=standard
pic16f877.build.nb_board=pic16f877
pic16f877.build.extra_flags=

pic16f877.menu.optimize.size=Size (default)
pic16f877.menu.optimize.size.build.nb_optimize=size
pic16f877.menu.optimize.speed=Speed
pic16f877.menu.optimize.speed.build.nb_optimize=speed
pic16f877.menu.optimize.none=None
pic16f877.menu.optimize.none.build.nb_optimize=none

pic16f877.menu.compiler.auto=Auto-detect SDCC (default)
pic16f877.menu.compiler.auto.build.nb_compiler=auto
pic16f877.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f877.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 256 B EEPROM. PICkit 3 over ICSP. USART on RC6/RC7. Unlike a classic 8051 this part has real I2C, SPI, PWM and ADC hardware.
pic16f877a.name=16F877A (8 K words, PICkit 3)
pic16f877a.upload.tool=niusburner
pic16f877a.upload.protocol=pickit3
pic16f877a.upload.maximum_size=8192
pic16f877a.upload.maximum_data_size=368
pic16f877a.upload.require_upload_port=false
pic16f877a.build.mcu=16F877A
pic16f877a.build.f_cpu=20000000L
pic16f877a.build.board=16F877A
pic16f877a.build.core=niusburner
pic16f877a.build.variant=standard
pic16f877a.build.nb_board=pic16f877a
pic16f877a.build.extra_flags=

pic16f877a.menu.optimize.size=Size (default)
pic16f877a.menu.optimize.size.build.nb_optimize=size
pic16f877a.menu.optimize.speed=Speed
pic16f877a.menu.optimize.speed.build.nb_optimize=speed
pic16f877a.menu.optimize.none=None
pic16f877a.menu.optimize.none.build.nb_optimize=none

pic16f877a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f877a.menu.compiler.auto.build.nb_compiler=auto
pic16f877a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f877a.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 K words, 18-pin, USART, ANSEL analog select.
pic16f88.name=16F88 (4 K words, PICkit 3)
pic16f88.upload.tool=niusburner
pic16f88.upload.protocol=pickit3
pic16f88.upload.maximum_size=4096
pic16f88.upload.maximum_data_size=368
pic16f88.upload.require_upload_port=false
pic16f88.build.mcu=16F88
pic16f88.build.f_cpu=20000000L
pic16f88.build.board=16F88
pic16f88.build.core=niusburner
pic16f88.build.variant=standard
pic16f88.build.nb_board=pic16f88
pic16f88.build.extra_flags=

pic16f88.menu.optimize.size=Size (default)
pic16f88.menu.optimize.size.build.nb_optimize=size
pic16f88.menu.optimize.speed=Speed
pic16f88.menu.optimize.speed.build.nb_optimize=speed
pic16f88.menu.optimize.none=None
pic16f88.menu.optimize.none.build.nb_optimize=none

pic16f88.menu.compiler.auto=Auto-detect SDCC (default)
pic16f88.menu.compiler.auto.build.nb_compiler=auto
pic16f88.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f88.menu.compiler.configured.build.nb_compiler=configured
